Peach17-pan/Skydimo-MVP/examples/sdkconfig.defaults
# ESP32-S3 LVGL 红色全屏显示 - SDK 配置
# 由 idf.py save-defconfig 生成

# 目标芯片
CONFIG_IDF_TARGET="esp32s3"

# Flash 配置
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# 分区表
CONFIG_PARTITION_TABLE_CUSTOM=y

# 编译器优化
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# SPIRAM (PSRAM) 配置
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# FreeRTOS 配置
CONFIG_FREERTOS_HZ=1000

# LVGL 配置
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y

# LVGL 字体
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y

